# InstanceNode Class (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
InstanceNode Class
Members See Also
---
An output node that represents a family instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class InstanceNode : GroupNode
```

Visual Basic
---
```text
Public Class InstanceNode _
	Inherits GroupNode
```

Visual C++
---
```text
public ref class InstanceNode : public GroupNode
```

# Remarks
See also: OnInstanceBegin(InstanceNode).
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..RenderNode Autodesk.Revit.DB..::..GroupNode Autodesk.Revit.DB..::..InstanceNode
# See Also
InstanceNode Members
Autodesk.Revit.DB Namespace